In [7]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//DFF.csv",header=None) #relative path represented as ..
data3.columns=['Date3','DFF']
print(data3.columns)

Index(['Date3', 'DFF'], dtype='object')

In [8]:
data3=data3.drop(index=[0])
data3

            Date3   DFF
1      1954-07-01  1.13
2      1954-07-02  1.25
3      1954-07-03  1.25
4      1954-07-04  1.25
5      1954-07-05  0.88
...           ...   ...
25736  2024-12-15  4.58
25737  2024-12-16  4.58
25738  2024-12-17  4.58
25739  2024-12-18  4.58
25740  2024-12-19  4.33

[25740 rows x 2 columns]

In [9]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['DFF']=pd.to_numeric(data3['DFF'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

           Date3   DFF
1     1954-07-01  1.13
2     1954-07-02  1.25
3     1954-07-03  1.25
4     1954-07-04  1.25
5     1954-07-05  0.88
...          ...   ...
25736 2024-12-15  4.58
25737 2024-12-16  4.58
25738 2024-12-17  4.58
25739 2024-12-18  4.58
25740 2024-12-19  4.33

[25740 rows x 2 columns]

In [10]:
data3.set_index('Date3',inplace=True) 
quarterly3=data3.resample('ME').mean() 
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3       DFF
0   1954-07-31  0.799355
1   1954-08-31  1.220645
2   1954-09-30  1.066667
3   1954-10-31  0.848710
4   1954-11-30  0.833667
..         ...       ...
841 2024-08-31  5.330000
842 2024-09-30  5.130000
843 2024-10-31  4.830000
844 2024-11-30  4.638333
845 2024-12-31  4.566842

[846 rows x 2 columns]

In [11]:
quarterly3.to_csv("DFF_quarterly.csv", index=False)

In [12]:
quarterly3

         Date3       DFF
0   1954-07-31  0.799355
1   1954-08-31  1.220645
2   1954-09-30  1.066667
3   1954-10-31  0.848710
4   1954-11-30  0.833667
..         ...       ...
841 2024-08-31  5.330000
842 2024-09-30  5.130000
843 2024-10-31  4.830000
844 2024-11-30  4.638333
845 2024-12-31  4.566842

[846 rows x 2 columns]